st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Consumer_CLI_RTOS/Src/usbpd_dpm.c
#ifdef USBPD_CLI
#ifndef HAL_UART_MODULE_ENABLED
#error "To enable the CLI you need the HAL_UART_MODULE_ENABLED"
#endif
  /* CLI enabling */
  CLI_Init(BSP_USART_GetHandle());
  CLI_Run();
#endif /* USBPD_CLI */  
  /* PWR SET UP */
  USBPD_PWR_IF_Init();
  USBPD_PWR_IF_PowerResetGlobal();
  
  /* PE SET UP : Port 0 */
  USBPD_PE_Init(USBPD_PORT_0, DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole, dpmCallbacks);

  /* CAD SET UP : Port 0 */
  USBPD_CAD_Init(USBPD_PORT_0, CAD_cbs);

  /* Enable CAD on Port 0 */
  USBPD_CAD_PortEnable(USBPD_PORT_0, USBPD_CAD_ENABLE);
  
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 2);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  PETaskHandle = NULL;
  
  return USBPD_OK;
}

/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  for(;;)
  {
    USBPD_PE_SNKProcess(USBPD_PORT_0);
    osDelay(2);
  }
}


/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(CAD_Task_delay);
  }
}


#ifdef USBPD_CLI
static char buffer[CLI_OUTPUT_MAX_SIZE];
#endif
/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  if ( (PortNum==USBPD_PORT_0) && (State == USBPD_CAD_STATE_ATTACHED) )
  {
    /* An ufp is attached on the port*/
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */

    USBPD_PE_IsCableConnected(PortNum, 1);
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    /* Create PE task */
    if (PETaskHandle == NULL)
    {
      osThreadDef(PETask, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 2);
      PETaskHandle = osThreadCreate(osThread(PETask), NULL);
    }
#ifdef USBPD_CLI
    sprintf(buffer, "\r\n*** Attached: Port %d CC%d\r\n>", PortNum, Cc);
    CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
  }
  else if ((PortNum==USBPD_PORT_0)&&( State==USBPD_CAD_STATE_DETACHED ))
  {
    osDelay(100);
    /* The ufp is detached */
    USBPD_PE_IsCableConnected(PortNum, 0);
    /* Terminate PE task */
    if (PETaskHandle != NULL)
    {
      osThreadTerminate(PETaskHandle);
      PETaskHandle = NULL;
    }
    DPM_Ports[PortNum].DPM_IsConnected = 0;

#ifdef USBPD_LED_SERVER      
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */

#ifdef USBPD_CLI
    sprintf(buffer, "\r\n*** Detached: Port %d\r\n>", PortNum);
    CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
  }
  osDelay(10);
}


/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @param  CurrentRole the current role
  * @param  Status status on hard reset event
  * @retval 0 if continue 1 otherwise
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
  uint32_t ret = 1;
  switch (Status)
  {
  case USBPD_HR_STATUS_START_ACK:
  case USBPD_HR_STATUS_START_REQ:
    ret = (uint32_t)USBPD_PWR_IF_IsEnabled(PortNum);
    break;
  case USBPD_HR_STATUS_COMPLETED:
    break;
  default:
      break;
  }
 return ret;
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

  /* Check if get the right pdo position */
  if (rdoposition > 0)
  {
    USBPD_PWR_IF_SetProfile(PortNum, rdoposition-1);
  }
  else
  {
    /* Put it to VSafe5V */
    USBPD_PWR_IF_SetProfile(PortNum, 0);
  }
  
#ifdef USBPD_CLI
  USBPD_SRCFixedSupplyPDO_TypeDef pdo;
  float voltage;
  uint8_t source = DPM_Ports[PortNum].DPM_PortPowerRole == USBPD_PORTPOWERROLE_DRP_SRC || DPM_Ports[PortNum].DPM_PortPowerRole == USBPD_PORTPOWERROLE_SRC;
    
  if (source)
  {
    pdo.d32 = 0; //PE_Handles[PortNum].PE_ListOfPDO[PE_Handles[PortNum].PE_RDOPosition-1];
    voltage = ((float)(pdo.b.VoltageIn50mVunits * 50 / 1000.0));
  }
  else
  {
    //PE_Handles[PortNum].PE_SNKRDOPosition = PE_Handles[PortNum].PE_RequestDOMsg >> 28;
    pdo.d32 = 0; //PE_Handles[PortNum].PE_ListOfRcvPDO[PE_Handles[PortNum].PE_SNKRDOPosition-1];
    voltage = ((float)(pdo.b.VoltageIn50mVunits * 50 / 1000.0));
    //PE_Handles[PortNum].PE_RequestedVoltge = pdo.b.VoltageIn50mVunits * 50;
  }
  
  if (DPM_Ports[PortNum].DPM_IsConnected)
  {
    sprintf(buffer, "\r\n*** Explicit Contract Done: Port %d Role %s @%d.%.2dV\r\n>", PortNum, source ? "Provider" : "Consumer",
    (uint16_t)voltage, ((uint16_t)((uint16_t)(voltage*100)%100)));
    CLI_Async_Notify(buffer);
  }
#endif /* USBPD_CLI */ 
}


/**
  * @brief  Callback function called by PE to inform DPM that an Explicit contract is established.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum)
{
  /* Turn On VBUS LED when an explicit contract is established */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_ON, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be read from DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_SRC_PDO Source PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_SNK_PDO Sink PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Received Source PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Received Sink PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Requested voltage value reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Request message DO reading requested (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data should be written (u32 pointer)
  * @param  Size Pointer on nb of u32 written by DPM
  * @retval None
  */
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t *Size)
{
  uint32_t index = 0;

