st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Consumer_CLI_RTOS/Src/usbpd_dpm.c
  pdhandle->DPM_RequestedVoltage = 0;
  
  USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Port Partner Requests Max Voltage\r");
  
  /* Find the Pdo index for the requested voltage */    	
  pdoindex = DPM_FindVoltageIndex(PortNum, &(pdhandle->DPM_SNKRequestedPower));
  
  /* If could not find desired pdo index, then return error */
  if (pdoindex == -1)
  {
    USBPD_ErrLog("PE_EvaluateCapability: could not find desired voltage\r");
    
    rdpfixed.d32 = 0;
    rdpfixed.b.ObjectPosition = 1;
    rdpfixed.b.OperatingCurrentIn10mAunits =  pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits / 10;
    rdpfixed.b.MaxOperatingCurrent10mAunits = pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits / 10;
    rdpfixed.b.CapabilityMismatch = 1;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, could not find desired pdo index\r");
    
    pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
    return USBPD_ERROR;
  }
  
  /* Extract power information from Power Data Object */
  USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Extract power information from Power Data Object\r");
  
  pdo = pdhandle->DPM_ListOfRcvSRCPDO[pdoindex];
  
  mv = ((pdo >> 10) & 0x3FF) * 50; /* mV */
  if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
  {
    mw = (pdo & 0x3FF) * 250; /* mW */
    mw = USBPD_MIN(mw, pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits); /* mW */
    ma = mw/mv; /* mA */
  }
  else
  {
    ma = (pdo & 0x3FF) * 10; /* mA */
  }
  ma = USBPD_MIN(ma, pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
  mw = ma * mv; /* mW */
  
  if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
  {
    rdpbattery.d32 = 0;
    rdpbattery.b.ObjectPosition = pdoindex + 1;
    rdpbattery.b.OperatingPowerIn250mWunits = mw / 250;
    rdpbattery.b.MaxOperatingPowerIn250mWunits = mw / 250; 
    if(mw < pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits)
    {
      rdpbattery.b.CapabilityMismatch = 1;
      USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, less power offered than the operating power\r");
    }
    pdhandle->DPM_RequestDOMsg = rdpbattery.d32;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Battery Request Data Object %u: %d mW", pdhandle->DPM_RequestDOMsg, mw);
  }
  else
  {
    rdpfixed.d32 = 0;
    rdpfixed.b.ObjectPosition = pdoindex + 1;
    rdpfixed.b.OperatingCurrentIn10mAunits = ma / 10;
    rdpfixed.b.MaxOperatingCurrent10mAunits = ma / 10; 
    if(mw < pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits)
    {
      rdpfixed.b.CapabilityMismatch = 1;
      USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Mismatch, less power offered than the operating power\r");
    }
    pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
    USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Fixed Request Data Object %u: %d mV, %d mA", pdhandle->DPM_RequestDOMsg, mv, ma);
  }
  
  /* Get the requested voltage */
  pdhandle->DPM_RequestedVoltage = mv;
  pdhandle->DPM_SNKRDOPosition = pdoindex + 1;
  
  return USBPD_OK;
}


/**
  * @brief  Prepare sending of a new Request according to Capabilities Message from Source port
  * @param  PortNum   Index of current used port
  * @retval PDOIndex  Index of PDO within source capabilities message
  *                   PDOIndex must be from 1 to Number of received profiles
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex)
{
  uint32_t mv = 0, mw = 0, ma = 0, pdo;
  USBPD_SNKFixedVariableRDO_TypeDef rdpfixed;
  USBPD_SNKBatteryRDO_TypeDef rdpbattery;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  
  if((PDOIndex <= pdhandle->DPM_NumberOfRcvSRCPDO) && (PDOIndex > 0))
  {
    /* Extract power information from Power Data Object */
    USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Extract power information from Power Data Object\r");
    
    pdo = pdhandle->DPM_ListOfRcvSRCPDO[PDOIndex - 1];
    
    mv = ((pdo >> 10) & 0x3FF) * 50; /* mV */
    if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
    {
      mw = (pdo & 0x3FF) * 250; /* mW */
      mw = USBPD_MIN(mw, pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits); /* mW */
      ma = mw/mv; /* mA */
    }
    else
    {
      ma = (pdo & 0x3FF) * 10; /* mA */
    }
    ma = USBPD_MIN(ma, pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
    mw = ma * mv; /* mW */
    
    if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
    {
      rdpbattery.d32 = 0;
      rdpbattery.b.ObjectPosition = PDOIndex;
      rdpbattery.b.OperatingPowerIn250mWunits = mw / 250;
      rdpbattery.b.MaxOperatingPowerIn250mWunits = mw / 250; 
      pdhandle->DPM_RequestDOMsg = rdpbattery.d32;
      USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Battery Request Data Object %u: %d mW", pdhandle->PE_RequestDOMsg, mw);
    }
    else
    {
      rdpfixed.d32 = 0;
      rdpfixed.b.ObjectPosition = PDOIndex;
      rdpfixed.b.OperatingCurrentIn10mAunits = ma / 10;
      rdpfixed.b.MaxOperatingCurrent10mAunits = ma / 10;
      pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
      USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Fixed Request Data Object %u: %d mV, %d mA", pdhandle->PE_RequestDOMsg, mv, ma);
    }
    
    /* Get the requested voltage */
    pdhandle->DPM_RequestedVoltage = mv;
    pdhandle->DPM_SNKRDOPosition = PDOIndex;
  }
  else
  {
    USBPD_ErrLog("USBPD_DPM_RequestNewPowerProfile: Invalid PDO index\r");
    return USBPD_ERROR;
  }
  return USBPD_OK;
}

/**
  * @brief  Request the PE to perform a Power Role Swap.
  * @param  PortNum: The current port number
  * @retval None
*/
void USBPD_DPM_RequestPowerRoleSwap(uint8_t PortNum)
{
  /* No Power Role Swap feature in case of a Consumer Only Port */
  (void)(PortNum);
}

/**
  * @brief  Capability status update
  * @param  PortNum Port number
  * @param  CurrentRole the current role
  * @param  Status status on capability event
  */
static void USBPD_DPM_Capability(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_CAP_Status_TypeDef Status)
{
  DPM_Ports[PortNum].DPM_RDOPosition = (DPM_Ports[PortNum].DPM_RequestDOMsg>>28);
}

/**
  * @brief  Find PDO index that offers the most amount of power.
  * @param  PortNum Port number
  * @param  PtrRequestedPower  Sink requested power profile structure pointer
  * @retval Index of PDO within source capabilities message (-1 indicating not found)
  */
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower)
{
  uint32_t mv = 0, index  = 0, mw = 0, ma = 0, voltage = 0;
  uint32_t nbpdo;
  uint32_t *ptpdoarray;
  
  /* Max voltage is always limited by the board's max request */
  voltage = USBPD_MIN(PtrRequestedPower->OperatingVoltageInmVunits, PtrRequestedPower->MaxOperatingVoltageInmVunits);
  
  /* The requested voltage not supported by this board */
  if(USBPD_IS_VALID_VOLTAGE(voltage, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
  {
    USBPD_ErrLog("DPM_FindVoltageIndex: Requested voltage not supported by the board\r");
    return (-1);
  }

  /* Search PDO index among Source PDO of Port */
  nbpdo = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
  ptpdoarray = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO;
  
  for(index = 0; index < nbpdo; index++)
  {
    mv = ((ptpdoarray[index] >> 10) & 0x3FF) * 50;
    
